Autodesk.Revit.DB.Events.RevitAPIEventStatus
Describes the status of an action which triggered a post event.
Describes the status of an action which triggered a post event.
Since:
2011

Autodesk.Revit.DB.Events.RevitAPIEventStatus.Cancelled
The action that triggered this event was cancelled by an event handler from the pre-event for the action.

Autodesk.Revit.DB.Events.RevitAPIEventStatus.Succeeded
The action that triggered this event succeeded.

Autodesk.Revit.DB.Events.RevitAPIEventStatus.Failed
The action that triggered this event failed .